simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Tmr_LedWait.h"
#include "DMA_DelSig_RAM_dma.h"
#include "DMA_DelSig_Filter_dma.h"
#include "EEPROM.h"
#include "DMA_Filter_RAM_dma.h"
#include "Filter.h"
#include "Filter_PVT.h"
#include "Clock_1.h"
#include "Button_aliases.h"
#include "Button.h"
#include "LED_aliases.h"
#include "LED.h"
#include "SYNC_IN_aliases.h"
#include "SYNC_IN.h"
#include "UART.h"
#include "Tmr_UartRxWatchdog.h"
#include "timer_clock.h"
#include "isr_SuperMaquina.h"
#include "state.h"
#include "error.h"
#include "status.h"
#include "reset.h"
#include "cfg.h"
#include "ctrl.h"
#include "VDAC_ref_PGA.h"
#include "timer_clock_4.h"
#include "Tmr_PingCalTick.h"
#include "timer_clock_3.h"
#include "timer_clock_5.h"
#include "Tmr_CaptureWatchdog.h"
#include "tmr_event.h"
#include "LPF_1.h"
#include "PGAgain.h"
#include "OPAadder.h"
#include "LPo_aliases.h"
#include "LPo.h"
#include "LPm_aliases.h"
#include "LPm.h"
#include "OPAlp.h"
#include "ADDERm_aliases.h"
#include "ADDERm.h"
#include "VDAC_Ref_Adder.h"
#include "BPm_aliases.h"
#include "BPm.h"
#include "ADDERo_aliases.h"
#include "ADDERo.h"
#include "BPo_aliases.h"
#include "BPo.h"
#include "OPAbp.h"
#include "SEo_aliases.h"
#include "SEo.h"
#include "ADC.h"
#include "INn_aliases.h"
#include "INn.h"
#include "INp_aliases.h"
#include "INp.h"
#include "PGAn.h"
#include "PGAp.h"
#include "OPAref.h"
#include "LPF_2.h"
#include "VDAC_ref_LP.h"
#include "Vref_aliases.h"
#include "Vref.h"
#include "AMux_ADC.h"
#include "AMux_aliases.h"
#include "AMux.h"
#include "PGAshield.h"
#include "Vshield_aliases.h"
#include "Vshield.h"
#include "Vref_BP_aliases.h"
#include "Vref_BP.h"
#include "Vref_PGA_aliases.h"
#include "Vref_PGA.h"
#include "Vref_ADDER_aliases.h"
#include "Vref_ADDER.h"
#include "Vref_LP_aliases.h"
#include "Vref_LP.h"
#include "VDAC_ref_BP.h"
#include "AMuxCapacitor_aliases.h"
#include "AMuxCapacitor.h"
#include "UART_IntClock.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

